{
    "version": "2.17.23",
    "build": "20251205",
    "release_date": "2025-12-05",
    "codename": "Colombus",
    "changelog": [
        {
            "version": "2.17.23",
            "date": "2025-12-05",
            "type": "major",
            "changes": [
                "Se ha mejorado la configuración de seguridad para evitar problemas de acceso a directorios",
                "Se ha optimizado el proceso de actualización para evitar errores de acceso a archivos antiguos",
                "Se ha corregido un problema de permisos que afectaba la estabilidad del sistema",
                "Se ha implementado una excepción de seguridad para el directorio de trabajo actual",
                "Se ha actualizado la forma en que se gestionan los directorios para evitar errores de propiedad",
                "Se ha mejorado la compatibilidad con diferentes versiones de Git para evitar problemas de acceso",
                "Se ha optimizado el rendimiento al acceder a archivos y directorios para mejorar la velocidad del sistema",
                "Se ha solucionado un problema que impedía el acceso a versiones antiguas de los archivos en el sistema"
            ]
        },
        {
            "version": "2.17.22",
            "date": "2025-12-03",
            "type": "major",
            "changes": [
                "Se ha mejorado la accesibilidad a los directorios del sistema para evitar problemas de permisos",
                "El rendimiento del sistema ha sido optimizado para una experiencia más fluida",
                "Se ha actualizado la configuración de seguridad para permitir acceso a directorios específicos",
                "Se ha corregido un error que impedía el acceso a archivos en el historial del sistema",
                "Se ha implementado una solución para evitar problemas de ownership en el repositorio",
                "La estabilidad del sistema ha sido mejorada para reducir la probabilidad de errores",
                "Se ha agregado una excepción de seguridad para el directorio del sistema",
                "El acceso a los registros del sistema ha sido optimizado para una navegación más rápida"
            ]
        },
        {
            "version": "2.17.21",
            "date": "2025-12-03",
            "type": "minor",
            "changes": [
                "Correcciones de errores y mejoras de estabilidad",
                "Optimizaciones de rendimiento del sistema",
                "Mejoras en la experiencia de usuario",
                "Actualizaciones de seguridad",
                "Corrección de bugs menores"
            ]
        },
        {
            "version": "2.17.20",
            "date": "2025-12-02",
            "type": "major",
            "changes": [
                "Se agrego NovaRey Agent paraa manejo y consultas del sistema asi como otros fixes."
            ]
        },
        {
            "version": "2.17.19",
            "date": "2025-12-02",
            "type": "minor",
            "changes": [
                "Se ha mejorado la compatibilidad con sistemas de archivos para evitar problemas de permisos y propietarios",
                "Se ha optimizado la configuración de seguridad para permitir la ejecución en directorios específicos",
                "Se ha actualizado la detección de errores para proporcionar mensajes más claros y útiles en caso de problemas",
                "Se ha corregido un problema de acceso a archivos que impedía la visualización de versiones anteriores",
                "Se ha implementado una solución para evitar errores de autenticación en directorios específicos",
                "Se ha mejorado la estabilidad del sistema para reducir la probabilidad de errores y fallos",
                "Se ha optimizado el rendimiento del sistema para mejorar la velocidad y eficiencia en la ejecución de tareas",
                "Se ha actualizado el manejo de excepciones para proporcionar una experiencia de usuario más fluida y segura"
            ]
        },
        {
            "version": "2.17.18",
            "date": "2025-12-02",
            "type": "minor",
            "changes": [
                "Se ha mejorado la estabilidad del sistema al resolver problemas de acceso a archivos y directorios",
                "Se ha optimizado la configuración de seguridad para permitir un acceso más seguro a los repositorios",
                "Se ha actualizado la forma en que se manejan las excepciones de directorios para evitar problemas de acceso",
                "Se ha corregido un error que impedía el acceso a versiones anteriores del sistema",
                "Se ha implementado una nueva forma de manejar los permisos de acceso a los archivos y directorios",
                "Se ha mejorado la compatibilidad con diferentes entornos de trabajo para evitar conflictos",
                "Se ha optimizado el proceso de resolución de conflictos de acceso a los archivos y directorios",
                "Se ha actualizado la documentación para reflejar los cambios realizados en la configuración de seguridad"
            ]
        },
        {
            "version": "2.17.17",
            "date": "2025-12-02",
            "type": "major",
            "changes": [
                "Se ha mejorado la estabilidad del sistema al resolver problemas de acceso a directorios",
                "Se ha optimizado la seguridad del repositorio para prevenir accesos no autorizados",
                "Se ha actualizado la configuración global para incluir excepciones de directorios seguros",
                "Se ha corregido un error que impedía el acceso a versiones anteriores del sistema",
                "Se ha implementado una nueva forma de manejar los directorios para evitar conflictos de permisos",
                "Se ha mejorado la capacidad del sistema para detectar y solucionar problemas de acceso a archivos",
                "Se ha optimizado el rendimiento del sistema al reducir los errores de acceso a directorios",
                "Se ha aumentado la confiabilidad del sistema al resolver problemas de integridad de datos"
            ]
        },
        {
            "version": "2.17.16",
            "date": "2025-12-02",
            "type": "major",
            "changes": [
                "Se ha mejorado la seguridad del acceso a los directorios del sistema para evitar problemas de permisos",
                "Se ha optimizado la configuración de Git para evitar errores de autenticación en el directorio de trabajo",
                "Se ha corregido un problema de acceso a los históricos de commits para mejorar la experiencia del usuario",
                "Se ha implementado una excepción de seguridad para el directorio de trabajo actual para evitar errores de acceso",
                "Se ha actualizado la gestión de directorios para mejorar la estabilidad y el rendimiento del sistema",
                "Se ha resuelto un problema de compatibilidad con la versión anterior para asegurar una transición suave",
                "Se ha mejorado la detección de errores para proporcionar mensajes más claros y útiles al usuario",
                "Se ha optimizado el proceso de actualización para reducir el tiempo de inactividad del sistema"
            ]
        },
        {
            "version": "2.17.15",
            "date": "2025-12-02",
            "type": "major",
            "changes": [
                "Se ha mejorado la estabilidad del sistema al solucionar un problema de acceso a directorios.",
                "Se ha optimizado la configuración de seguridad para evitar errores de ownership en el repositorio.",
                "Se ha actualizado la gestión de permisos para evitar conflictos y mejorar la experiencia del usuario.",
                "Se ha corregido un error que impedía acceder a versiones anteriores del sistema.",
                "Se ha implementado una nueva excepción de seguridad para permitir el acceso a directorios específicos.",
                "Se ha mejorado la detección de errores para evitar problemas de acceso a archivos y directorios.",
                "Se ha optimizado la performance del sistema al solucionar un problema de acceso a la historia de commits."
            ]
        },
        {
            "version": "2.17.14",
            "date": "2025-12-02",
            "type": "major",
            "changes": [
                "Se ha mejorado la estabilidad del sistema al solucionar un problema de acceso a archivos",
                "Se ha optimizado la configuración de seguridad para evitar problemas de permisos en el futuro",
                "Se ha actualizado la compatibilidad con sistemas de archivos para una mejor integración",
                "Se ha corregido un error que impedía el acceso a archivos en versiones anteriores",
                "Se ha implementado una medida de seguridad adicional para proteger la integridad de los datos",
                "Se ha mejorado la capacidad del sistema para manejar directorios y subdirectorios",
                "Se ha resuelto un problema de acceso a la historia de commits para una mejor trazabilidad",
                "Se ha optimizado el rendimiento general del sistema para una experiencia de usuario más fluida"
            ]
        },
        {
            "version": "2.17.13",
            "date": "2025-12-02",
            "type": "major",
            "changes": [
                "Se ha mejorado la estabilidad del sistema al solucionar un problema de acceso a directorios.",
                "Se ha optimizado la configuración de seguridad para evitar advertencias de acceso no autorizado.",
                "Se ha actualizado la compatibilidad con sistemas de archivos para mejorar la integridad de los datos.",
                "Se ha corregido un error que impedía el acceso a versiones anteriores del sistema.",
                "Se ha implementado una solución para evitar problemas de propiedad en el repositorio.",
                "Se ha mejorado la detección de errores para proporcionar mensajes más claros y útiles.",
                "Se ha optimizado el rendimiento al reducir los mensajes de advertencia innecesarios.",
                "Se ha actualizado la gestión de permisos para mejorar la seguridad y la estabilidad del sistema."
            ]
        },
        {
            "version": "2.17.12",
            "date": "2025-12-02",
            "type": "minor",
            "changes": [
                "Se ha mejorado la estabilidad del sistema al resolverser problemas de acceso a directorios",
                "Se ha optimizado la configuración de Git para evitar errores de acceso a archivos",
                "Se ha actualizado la compatibilidad con diferentes versiones de Git para evitar conflictos",
                "Se ha corregido un error que impedía el acceso a commits anteriores en el repositorio",
                "Se ha implementado una excepción de seguridad para permitir el acceso a directorios específicos",
                "Se ha mejorado la capacidad del sistema para manejar errores de acceso a archivos y directorios",
                "Se ha optimizado la velocidad de acceso a los registros de cambios en el repositorio",
                "Se ha actualizado la información de depuración para ayudar a identificar y solucionar problemas de forma más eficiente"
            ]
        },
        {
            "version": "2.17.11",
            "date": "2025-12-02",
            "type": "major",
            "changes": [
                "Se ha mejorado la seguridad de acceso a los directorios para evitar problemas de permisos",
                "Se ha optimizado la configuración global para admitir directorios con propietarios dudosos",
                "Se ha actualizado el manejo de excepciones para directorios con acceso restringido",
                "Se ha corregido un error que impedía el acceso a commits anteriores en el repositorio",
                "Se ha implementado una nueva configuración para admitir directorios con propietarios no estándar",
                "Se ha mejorado la estabilidad del sistema al acceder a directorios con permisos especiales",
                "Se ha resuelto un problema de acceso a commits antiguos que generaba un error de acceso",
                "Se ha optimizado el rendimiento al acceder a directorios con un gran número de archivos"
            ]
        },
        {
            "version": "2.17.10",
            "date": "2025-12-02",
            "type": "minor",
            "changes": [
                "Se ha mejorado la seguridad del sistema para evitar accesos no autorizados a los directorios del proyecto",
                "Se ha optimizado la configuración de Git para evitar errores de ownership en el repositorio",
                "Se ha actualizado la compatibilidad con versiones anteriores para reducir los errores de acceso a los registros",
                "Se ha corregido un problema de acceso a los archivos de versión anterior para mejorar la estabilidad",
                "Se ha implementado una nueva funcionalidad para agilizar la resolución de conflictos de acceso a los directorios",
                "Se ha mejorado la detección de errores para proporcionar mensajes más claros y útiles a los usuarios",
                "Se ha optimizado el rendimiento del sistema para reducir los tiempos de carga y espera",
                "Se ha actualizado la gestión de permisos para evitar problemas de acceso no autorizado a los archivos y directorios del proyecto"
            ]
        },
        {
            "version": "2.17.9",
            "date": "2025-12-02",
            "type": "major",
            "changes": [
                "Se ha mejorado la detección de problemas de permisos en el sistema de archivos para evitar errores inesperados",
                "Se ha optimizado el acceso a archivos y directorios para mejorar la estabilidad general del sistema",
                "Se ha actualizado la configuración de seguridad para permitir una mayor flexibilidad en la gestión de directorios",
                "Se ha corregido un problema de acceso a archivos antiguos que impedía la visualización de registros históricos",
                "Se ha implementado una nueva política de seguridad para evitar accesos no autorizados al sistema",
                "Se ha mejorado la compatibilidad con diferentes sistemas de archivos para reducir errores y conflictos",
                "Se ha optimizado el rendimiento del sistema al acceder a directorios y archivos para mejorar la experiencia del usuario",
                "Se ha actualizado la detección de errores para proporcionar mensajes más claros y útiles en caso de problemas"
            ]
        },
        {
            "version": "2.17.8",
            "date": "2025-12-01",
            "type": "major",
            "changes": [
                "Se ha mejorado la estabilidad del sistema para prevenir errores inesperados",
                "Se ha optimizado el acceso a los directorios para una navegación más rápida",
                "Se ha corregido un problema de compatibilidad con sistemas de archivos",
                "Se ha implementado una nueva función de verificación de integridad de datos",
                "Se ha actualizado la interfaz de usuario para una experiencia más intuitiva",
                "Se ha mejorado la gestión de permisos para un control más preciso",
                "Se ha resuelto un problema de acceso a archivos en directorios superiores",
                "Se ha optimizado el rendimiento general del sistema para una respuesta más rápida"
            ]
        },
        {
            "version": "2.10.6",
            "date": "2025-12-02",
            "type": "major",
            "changes": [
                "Se ha actualizado el script de publicación para mejorar la eficiencia en la entrega de nuevas versiones.",
                "La versión del software ha sido actualizada para reflejar los cambios más recientes.",
                "Se ha optimizado el proceso de lanzamiento para reducir el tiempo de espera entre versiones.",
                "El archivo de versión ha sido corregido para mostrar la información correctamente.",
                "El script de publicación ha sido mejorado para evitar errores comunes.",
                "La entrega de la nueva versión ha sido implementada con éxito.",
                "Se ha corregido un problema menor en el script de publicación para garantizar la estabilidad.",
                "La versión actual ha sido verificada para asegurar la compatibilidad con sistemas anteriores."
            ]
        },
        {
            "version": "2.10.5",
            "date": "2025-12-01",
            "type": "major",
            "changes": [
                "Se ha mejorado la eficiencia del proceso de publicación de versiones gracias a la actualización del script de lanzamiento.",
                "La versión del software ha sido actualizada para reflejar los cambios realizados en la plataforma.",
                "Se ha optimizado el manejo de metadatos en el archivo de versión para una mejor organización.",
                "El proceso de lanzamiento ha sido simplificado y agilizado para reducir el tiempo de espera de los usuarios.",
                "La compatibilidad del software con diferentes entornos ha sido corregida y mejorada para una experiencia más fluida.",
                "Se ha implementado una nueva forma de controlar la versión del software para una mayor precisión y seguridad.",
                "El script de publicación ha sido mejorado para manejar errores y excepciones de manera más efectiva.",
                "La información de versión ahora se carga de manera más eficiente para reducir el tiempo de carga del software.",
                "Se ha mejorado el sistema de auditoria."
            ]
        },
        {
            "version": "2.10.4",
            "date": "2025-12-02",
            "type": "minor",
            "changes": [
                "Se ha actualizado el script de publicación de lanzamientos para mejorar la eficiencia del proceso de entrega de nuevas versiones.",
                "La información de versión se ha actualizado para reflejar los cambios más recientes en el software.",
                "El proceso de lanzamiento de nuevas versiones ahora es más rápido y confiable.",
                "Se han realizado ajustes internos para mejorar la calidad general del producto.",
                "La versión actual refleja nuestro compromiso constante con la mejora y la innovación.",
                "El manejo de versiones ha sido optimizado para ofrecer una mejor experiencia al usuario.",
                "El script de publicación se ha revisado para minimizar posibles errores durante el lanzamiento.",
                "La información de versión se mantiene actualizada para garantizar la transparencia y la confiabilidad del software."
            ]
        },
        {
            "version": "2.10.3",
            "date": "2025-12-01",
            "type": "minor",
            "changes": [
                "Correcciones de errores y mejoras de estabilidad",
                "Optimizaciones de rendimiento del sistema",
                "Mejoras en la experiencia de usuario",
                "Actualizaciones de seguridad",
                "Corrección de bugs menores"
            ]
        },
        {
            "version": "2.10.2",
            "date": "2025-12-01",
            "type": "major",
            "changes": [
                "Problema local con la actualización de la versión ahora si funciona todo esperemos xd esto es un salto de fe"
            ]
        },
        {
            "version": "2.10.1",
            "date": "2025-12-01",
            "type": "minor",
            "changes": [
                "Se arreglo el problema que versión.json no se actualiza"
            ]
        },
        {
            "version": "2.10.0",
            "date": "2025-12-01",
            "type": "major",
            "changes": [
                "Se mejoro el sistema de updates",
                "Se agregaron cambios importantes",
                "Se arreglo la instalación de updates"
            ]
        },
        {
            "version": "2.9.0",
            "date": "2025-12-01",
            "type": "major",
            "changes": [
                "Hoy si se soluciono todo espero."
            ]
        },
        {
            "version": "2.8.0",
            "date": "2025-12-01",
            "type": "major",
            "changes": [
                "Se modificaron todas las funciones en la app basicamente xd"
            ]
        },
        {
            "version": "2.7.0",
            "date": "2025-12-01",
            "type": "minor",
            "changes": [
                "Se mejoro hoy si por completo sistema de updates",
                "Se agrego la subida y creación de tags con sus archivos",
                "Ahora se mejorara la instalación de updates en archivos des actualizados o con versión menor."
            ]
        },
        {
            "version": "2.6.0",
            "date": "2025-12-01",
            "type": "major",
            "changes": [
                "Se mejoro todo el sistema de actualizaciones y demás cuando funcione del todo correctamente me animo documentar updates"
            ]
        },
        {
            "version": "2.5.0",
            "date": "2025-12-01",
            "type": "major",
            "changes": [
                "Sistema de login multi-factor implementado",
                "Soporte para llaves de seguridad WebAuthn\/FIDO2",
                "Autenticación biométrica (huella, Face ID, Windows Hello)",
                "PIN de seguridad de 4-6 dígitos",
                "Dispositivos de confianza con cookies seguras",
                "Integración completa con 2FA existente",
                "Página de verificación unificada",
                "Correcciones de sintaxis JavaScript",
                "Mejoras en notificaciones con Alpine.js"
            ]
        },
        {
            "version": "2.4.0",
            "date": "2025-11-20",
            "type": "minor",
            "changes": [
                "Sistema de notificaciones mejorado",
                "Modo oscuro completo",
                "Mejoras de rendimiento"
            ]
        }
    ],
    "system_requirements": {
        "php": ">=7.4",
        "mysql": ">=5.7",
        "extensions": [
            "mysqli",
            "json",
            "session",
            "openssl"
        ]
    }
}